---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.GenericForm
source: html/6e55796d-1b8b-8910-550e-5c3db5b56312.htm
---
# GenericForm Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.